app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY title
SELECT "movies".* FROM "movies" ORDER BY release_date
---
    end

    if @ratings and @order
      @movies = Movie.where(rating: @ratings.keys).order(@order)
    elsif @order
      @movies = Movie.order(@order)